In [1]:
# !pip install psycopg2
# !pip install ipython-sql
import psycopg2
%load_ext sql

In [2]:
DB_USER ="postgres"
DB_PASSWORD = "123456"
DB_NAME="dvdrental"
DB_PORT ="localhost"
# postgresql://username:password@host:port/database
conn_string="postgresql://{}:{}@{}/{}"\
                            .format(DB_USER, DB_PASSWORD, DB_PORT, DB_NAME)

In [3]:
%sql $conn_string

# STEP2: Explore the 3NF Schema

### 2.1 How much? What data sizes are we looking at?

In [4]:
nStores = %sql select count(*) from store;
nFilms = %sql select count(*) from film;
nCustomers = %sql select count(*) from customer;
nRentals = %sql select count(*) from rental;
nPayment = %sql select count(*) from payment;
nStaff = %sql select count(*) from staff;
nCity = %sql select count(*) from city;
nCountry = %sql select count(*) from country;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.
 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

In [5]:
print("nFilms\t\t=", nFilms[0][0])
print("nCustomers\t=", nCustomers[0][0])
print("nRentals\t=", nRentals[0][0])
print("nPayment\t=", nPayment[0][0])
print("nStaff\t\t=", nStaff[0][0])
print("nStores\t\t=", nStores[0][0])
print("nCities\t\t=", nCity[0][0])
print("nCountry\t=", nCountry[0][0])

nFilms		= 1000
nCustomers	= 599
nRentals	= 16044
nPayment	= 14596
nStaff		= 2
nStores		= 2
nCities		= 600
nCountry	= 109

### 2.2 When? What time period are we talking about?

In [6]:
%%sql
select min(payment_date) as start, max(payment_date) as end from payment;

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(datetime.datetime(2007, 2, 14, 21, 21, 59, 996577), datetime.datetime(2007, 5, 14, 13, 44, 29, 996577))]

### 2.3 Where? Where do events in this databse occur?

In [7]:
%%sql
select district, sum(city_id) as n
from address
group by district
order by n desc
limit 10;

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Shandong', 3237),
 ('England', 2974),
 ('So Paulo', 2952),
 ('West Bengali', 2623),
 ('Buenos Aires', 2572),
 ('Uttar Pradesh', 2462),
 ('California', 2444),
 ('Southern Tagalog', 1931),
 ('Tamil Nadu', 1807),
 ('Hubei', 1790)]

# STEP3: Perform some simple data analysis

## 3.1 Insight 1: Top Grossing Movies
- Payments amounts are in table payment
- Movies are in table film
- They are not directly linked, payment refers to a rental, rental refers to an inventory item and inventory item refers to a film
- payment → rental → inventory → film

In [8]:
%%sql
SELECT title, sum(p.amount) as revenue             
FROM payment p 
JOIN rental r ON (p.rental_id = r.rental_id)
JOIN inventory i ON (r.inventory_id = i.inventory_id)
JOIN film f on (i.film_id = f.film_id)
group by title
order by revenue desc
limit 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Telegraph Voyage', Decimal('215.75')),
 ('Zorro Ark', Decimal('199.72')),
 ('Wife Turn', Decimal('198.73')),
 ('Innocent Usual', Decimal('191.74')),
 ('Hustler Party', Decimal('190.78')),
 ('Saturday Lambs', Decimal('190.74')),
 ('Titans Jerk', Decimal('186.73')),
 ('Harry Idaho', Decimal('177.73')),
 ('Torque Bound', Decimal('169.76')),
 ('Dogma Family', Decimal('168.72'))]

## 3.2 Insight 2: Top grossing cities
- Payments amounts are tin table payment
- Cities are table cities
- payment -> customer -> address -> city

In [9]:
%%sql
SELECT city.city, sum(p.amount) as amount
FROM payment as p
JOIN customer as c
ON p.customer_id = c.customer_id
JOIN address as a
ON a.address_id = c.address_id
JOIN city
ON city.city_id = a.city_id
GROUP BY city
ORDER BY amount DESC
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Saint-Denis', Decimal('211.55')),
 ('Cape Coral', Decimal('208.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('191.62')),
 ('Molodetno', Decimal('189.60')),
 ('Qomsheh', Decimal('183.63')),
 ('London', Decimal('174.54')),
 ('Memphis', Decimal('167.67')),
 ('Richmond Hill', Decimal('167.62')),
 ('Tanza', Decimal('166.61'))]

## 3.3 Insight 3: Revenue of a movie by customer city and by month

In [10]:
%%sql
SELECT film.title,city.city, sum(payment.amount) AS revenue, 
extract(MONTH FROM payment.payment_date) as month
FROM payment
JOIN customer
ON customer.customer_id = payment.customer_id
JOIN address
ON customer.address_id = address.address_id
JOIN city 
ON address.city_id = city.city_id
JOIN rental
ON payment.rental_id = rental.rental_id
JOIN inventory
ON inventory.inventory_id = rental.inventory_id
JOIN film
ON film.film_id = inventory.film_id
GROUP BY film.title, city.city, payment.payment_date
ORDER BY month, revenue DESC
LIMIT 10

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[('Saturday Lambs', 'Wroclaw', Decimal('10.99'), Decimal('2')),
 ('Telegraph Voyage', 'Datong', Decimal('10.99'), Decimal('2')),
 ('Mine Titans', 'Plock', Decimal('10.99'), Decimal('2')),
 ('Satisfaction Confidential', 'Suihua', Decimal('10.99'), Decimal('2')),
 ('Doors President', 'Zhoushan', Decimal('10.99'), Decimal('2')),
 ('Stranger Strangers', 'Czestochowa', Decimal('10.99'), Decimal('2')),
 ('Flintstones Happiness', 'Alessandria', Decimal('10.99'), Decimal('2')),
 ('Autumn Crow', 'Stockport', Decimal('10.99'), Decimal('2')),
 ('Behavior Runaway', 'Battambang', Decimal('10.99'), Decimal('2')),
 ('Telegraph Voyage', 'Pangkal Pinang', Decimal('10.99'), Decimal('2'))]

# STEP4: Creating fact and dimensions

### Creating the first dimension table

ToDo: Create a dimDate dimension table with the fields and data types shown in the ERD above

In [14]:
%%sql
CREATE TABLE dimDate(
    date_key INTEGER NOT NULL PRIMARY KEY,
    date DATE NOT NULL,
    year SMALLINT NOT NULL,
    quarter SMALLINT NOT NULL,
    month SMALLINT NOT NULL,
    day SMALLINT NOT NULL,
    week SMALLINT NOT NULL,
    is_weekend BOOLEAN
)

 * postgresql://postgres:***@localhost/dvdrental
(psycopg2.errors.DuplicateTable) relation "dimdate" already exists

[SQL: CREATE TABLE dimDate( date_key INTEGER NOT NULL PRIMARY KEY,
    date DATE NOT NULL,
    year SMALLINT NOT NULL,
    quarter SMALLINT NOT NULL,
    month SMALLINT NOT NULL,
    day SMALLINT NOT NULL,
    week SMALLINT NOT NULL,
    is_weekend BOOLEAN
)]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [15]:
%%sql
SELECT COLUMN_NAME, DATA_TYPE 
FROM INFORMATION_SCHEMA.COLUMNS 
WHERE TABLE_NAME = 'dimdate'

 * postgresql://postgres:***@localhost/dvdrental
8 rows affected.

[('date_key', 'integer'),
 ('date', 'date'),
 ('year', 'smallint'),
 ('quarter', 'smallint'),
 ('month', 'smallint'),
 ('day', 'smallint'),
 ('week', 'smallint'),
 ('is_weekend', 'boolean')]

In [16]:
%%sql
CREATE TABLE dimCustomer
(
  customer_key SERIAL PRIMARY KEY,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);

CREATE TABLE dimMovie
(
  movie_key          SERIAL PRIMARY KEY,
  film_id            smallint NOT NULL,
  title              varchar(255) NOT NULL,
  description        text,
  release_year       year,
  language           varchar(20) NOT NULL,
  original_language  varchar(20),
  rental_duration    smallint NOT NULL,
  length             smallint NOT NULL,
  rating             varchar(5) NOT NULL,
  special_features   varchar(60) NOT NULL
);
CREATE TABLE dimStore
(
  store_key           SERIAL PRIMARY KEY,
  store_id            smallint NOT NULL,
  address             varchar(50) NOT NULL,
  address2            varchar(50),
  district            varchar(20) NOT NULL,
  city                varchar(50) NOT NULL,
  country             varchar(50) NOT NULL,
  postal_code         varchar(10),
  manager_first_name  varchar(45) NOT NULL,
  manager_last_name   varchar(45) NOT NULL,
  start_date          date NOT NULL,
  end_date            date NOT NULL
);

 * postgresql://postgres:***@localhost/dvdrental
(psycopg2.errors.DuplicateTable) relation "dimcustomer" already exists

[SQL: CREATE TABLE dimCustomer (
  customer_key SERIAL PRIMARY KEY,
  customer_id  smallint NOT NULL,
  first_name   varchar(45) NOT NULL,
  last_name    varchar(45) NOT NULL,
  email        varchar(50),
  address      varchar(50) NOT NULL,
  address2     varchar(50),
  district     varchar(20) NOT NULL,
  city         varchar(50) NOT NULL,
  country      varchar(50) NOT NULL,
  postal_code  varchar(10),
  phone        varchar(20) NOT NULL,
  active       smallint NOT NULL,
  create_date  timestamp NOT NULL,
  start_date   date NOT NULL,
  end_date     date NOT NULL
);]
(Background on this error at: https://sqlalche.me/e/14/f405)

### Create the fact table

In [17]:
%%sql
CREATE TABLE factSales
(
    sales_key SERIAL PRIMARY KEY,
    date_key INTEGER REFERENCES dimdate (date_key), 
    customer_key INTEGER REFERENCES dimcustomer (customer_key),
    movie_key INTEGER REFERENCES dimmovie (movie_key),
    store_key INTEGER REFERENCES dimstore (store_key),
    sales_amount FLOAT NOT NULL
);

 * postgresql://postgres:***@localhost/dvdrental
(psycopg2.errors.DuplicateTable) relation "factsales" already exists

[SQL: CREATE TABLE factSales (
    sales_key SERIAL PRIMARY KEY,
    date_key INTEGER REFERENCES dimdate (date_key),
    customer_key INTEGER REFERENCES dimcustomer (customer_key),
    movie_key INTEGER REFERENCES dimmovie (movie_key),
    store_key INTEGER REFERENCES dimstore (store_key),
    sales_amount FLOAT NOT NULL
);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [18]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name   = 'factsales'

 * postgresql://postgres:***@localhost/dvdrental
6 rows affected.

[('sales_key', 'integer'),
 ('date_key', 'integer'),
 ('customer_key', 'integer'),
 ('movie_key', 'integer'),
 ('store_key', 'integer'),
 ('sales_amount', 'double precision')]

# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables

### Insert into dimdate

In [21]:
# %%sql
# INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
# SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
#        date(payment_date)                                           AS date,
#        EXTRACT(year FROM payment_date)                              AS year,
#        EXTRACT(quarter FROM payment_date)                           AS quarter,
#        EXTRACT(month FROM payment_date)                             AS month,
#        EXTRACT(day FROM payment_date)                               AS day,
#        EXTRACT(week FROM payment_date)                              AS week,
#        CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
# FROM payment;

Check result

In [20]:
%%sql
SELECT * FROM dimdate
LIMIT 5;

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(20070302, datetime.date(2007, 3, 2), 2007, 1, 3, 2, 9, False),
 (20070214, datetime.date(2007, 2, 14), 2007, 1, 2, 14, 7, False),
 (20070407, datetime.date(2007, 4, 7), 2007, 2, 4, 7, 14, True),
 (20070429, datetime.date(2007, 4, 29), 2007, 2, 4, 29, 17, True),
 (20070216, datetime.date(2007, 2, 16), 2007, 1, 2, 16, 7, False)]

#### Populate the dimCustomer table with data from the customer, address, city, and country tables

In [22]:
%%sql 
INSERT INTO dimCustomer(customer_key, customer_id, first_name, last_name,
                       email, address, address2, district, city, country,
                       postal_code, phone, active, create_date, start_date,
                       end_date)
SELECT c.customer_id as customer_key,
        c.customer_id,
        c.first_name,
        c.last_name,
        c.email,
        a.address,
        a.address2,
        a.district,
        city.city,
        country.country,
        a.postal_code,
        a.phone,
        c.active,
        c.create_date,
        now() AS start_date,
        now() AS end_date
FROM customer c
INNER JOIN address a
ON c.address_id = a.address_id
INNER JOIN city
ON city.city_id = a.city_id
INNER JOIN country
ON country.country_id = city.country_id;

 * postgresql://postgres:***@localhost/dvdrental
599 rows affected.

[]

check the result

In [23]:
%%sql
SELECT * FROM dimCustomer
LIMIT 10;

 * postgresql://postgres:***@localhost/dvdrental
10 rows affected.

[(524, 524, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', '1003 Qinhuangdao Street', '', 'West Java', 'Purwakarta', 'Indonesia', '25972', '35533115997', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (1, 1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (2, 2, 'Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (3, 3, 'Linda', 'Williams', 'linda.williams@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (4, 4, 'Barbara', 'Jones', 'barbara.jones@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (5, 5, 'Elizabeth', 'Brown', 'elizabeth.brown@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (6, 6, 'Jennifer', 'Davis', 'jennifer.davis@sakilacustomer.org', '1795 Santiago de Compostela Way', '', 'Texas', 'Laredo', 'United States', '18743', '860452626434', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (7, 7, 'Maria', 'Miller', 'maria.miller@sakilacustomer.org', '900 Santiago de Compostela Parkway', '', 'Central Serbia', 'Kragujevac', 'Yugoslavia', '93896', '716571220373', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (8, 8, 'Susan', 'Wilson', 'susan.wilson@sakilacustomer.org', '478 Joliet Way', '', 'Hamilton', 'Hamilton', 'New Zealand', '77948', '657282285970', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (9, 9, 'Margaret', 'Moore', 'margaret.moore@sakilacustomer.org', '613 Korolev Drive', '', 'Masqat', 'Masqat', 'Oman', '45844', '380657522649', 1, datetime.datetime(2006, 2, 14, 0, 0), datetime.date(2022, 6, 10), datetime.date(2022, 6, 10))]

##### TODO: Populate dimMovie table with data from film and language tables

In [28]:
%%sql
INSERT INTO dimmovie(movie_key, film_id, title, description, release_year,
                    language, original_language, rental_duration, length, rating,
                    special_features)
SELECT f.film_id AS movie_key,
        f.film_id,
        f.title,
        f.description,
        f.release_year,
        l.name AS language,
        l.name AS original_language,
        f.rental_duration,
        f.length,
        f.rating,
        f.special_features
FROM film f
INNER JOIN language l
ON l.language_id = f.language_id

 * postgresql://postgres:***@localhost/dvdrental
1000 rows affected.

[]

check result

In [30]:
%%sql
SELECT * FROM dimmovie
LIMIT 5;

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(133, 133, 'Chamber Italian', 'A Fateful Reflection of a Moose And a Husband who must Overcome a Monkey in Nigeria', 2006, 'English', 'English', 7, 117, 'NC-17', '{Trailers}'),
 (384, 384, 'Grosse Wonderful', 'A Epic Drama of a Cat And a Explorer who must Redeem a Moose in Australia', 2006, 'English', 'English', 5, 49, 'R', '{"Behind the Scenes"}'),
 (8, 8, 'Airport Pollock', 'A Epic Tale of a Moose And a Girl who must Confront a Monkey in Ancient India', 2006, 'English', 'English', 6, 54, 'R', '{Trailers}'),
 (98, 98, 'Bright Encounters', 'A Fateful Yarn of a Lumberjack And a Feminist who must Conquer a Student in A Jet Boat', 2006, 'English', 'English', 4, 73, 'PG-13', '{Trailers}'),
 (1, 1, 'Academy Dinosaur', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 'English', 'English', 6, 86, 'PG', '{"Deleted Scenes","Behind the Scenes"}')]

#### populate dimStore

In [45]:
# %%sql
# INSERT INTO dimStore(store_key, store_id, address, address2, district,
#                     city, country, postal_code, manager_first_name,
#                     manager_last_name, start_date, end_date)
# SELECT s.store_id as store_key,
#         s.store_id,
#         a.address,
#         a.address2,
#         a.district,
#         city.city,
#         country.country,
#         a.postal_code,
#         staff.first_name as manager_first_name,
#         staff.last_name as manager_last_name,
#         now() as start_date,
#         now() as end_date
# FROM store s
# INNER JOIN address a
# ON s.address_id = a.address_id
# INNER JOIN city
# ON a.city_id = city.city_id
# INNER JOIN country
# On country.country_id = city.country_id
# INNER JOIN staff
# ON staff.staff_id= s.manager_staff_id

check result

In [46]:
%%sql
SELECT * FROM dimstore
LIMIT 5;

 * postgresql://postgres:***@localhost/dvdrental
2 rows affected.

[(1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2022, 6, 10), datetime.date(2022, 6, 10)),
 (2, 2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.date(2022, 6, 10), datetime.date(2022, 6, 10))]

#### Create factSales and insert values into it

In [51]:
%%sql
INSERT INTO factSales (date_key, customer_key, movie_key, store_key,
                      sales_amount)
SELECT DISTINCT(TO_CHAR(p.payment_date :: DATE,'yyyyMMDD')::integer) AS date_key,
        p.customer_id as customer_key,
        i.film_id as movie_key,
        i.store_id as store_key,
        p.amount as sales_amount
FROM payment p
JOIN rental r ON(p.customer_id = r.customer_id)
JOIN inventory i ON (r.inventory_id=i.inventory_id);

 * postgresql://postgres:***@localhost/dvdrental
371300 rows affected.

[]

In [52]:
%%sql 
SELECT * FROM factSales
LIMIT 5;

 * postgresql://postgres:***@localhost/dvdrental
5 rows affected.

[(1, 20070407, 26, 641, 2, 6.99),
 (2, 20070319, 20, 274, 1, 2.99),
 (3, 20070429, 23, 464, 1, 0.99),
 (4, 20070218, 21, 81, 1, 4.99),
 (5, 20070407, 38, 761, 2, 4.99)]

# Conclusion
We were able to show that:

- The star schema is easier to understand and write queries against.
- Queries with a star schema are more performant.